Autodesk.Revit.DB.SolidUtils.GetBoundingBox(Autodesk.Revit.DB.Solid)
Retrieves a box that circumscribes the solid geometry.
Remarks:
The bounding box information is stored as bounds in local coordinates and a transform.
So the transform is to be taken in to account when using the bounds.
This is different from the bounding box returned by Element.BoundingBox in that the bounding box
returned by that routine stores the bounds in modeling coordinates with an identity transform.
geom:
The solid geometry.
Returns:
The bounding box.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.SolidUtils.IntersectSolidWithCurve(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.SolidCurveIntersectionOptions)
Calculates and returns the intersection between a curve and a solid.
solid:
The solid.
curve:
The curve.
options:
The options.  If NULL, the default options will be used.
Returns:
The intersection results.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
The input solid is not a closed geometric volume.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SolidUtils.TransformSolid(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Transform)
Transform input solid with the given transformation
solid:
The input solid to be transformed.
transform:
The transform (which must be conformal).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
-or-
transform has a scale that is negative or zero.
Since:
2018

Autodesk.Revit.DB.SolidUtils.Clone(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.SolidGeometryOptions)
Creates a new Solid which is a copy of the input Solid. Geometry data is copied with the options supplied by SolidGeometryOptions
solid:
The input solid to be copied.
Returns:
The newly created Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.SolidUtils.IsValidForTessellation(Autodesk.Revit.DB.Solid)
Tests if the input solid or shell is valid for tessellation.
solidOrShell:
The solid or shell.
Returns:
True if the solid or shell is valid for tessellation, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SolidUtils.TessellateSolidOrShell(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.SolidOrShellTessellationControls)
This function facets (i.e., triangulates) a solid or an open shell. Each boundary
component of the solid or shell is represented by a single triangulated structure.
Remarks:
Every point on the triangulation of a boundary component of the solid (or
shell) should lie within the 3D distance specified by the "accuracy" input of some
point on the triangulation, and vice-versa. In some cases, this constraint may be
implemented heuristically (not rigorously).
solidOrShell:
The solid or shell to be faceted.
tessellationControls:
This input controls various aspects of the triangulation.
Returns:
The triangulated structures corresponding to the boundary components of the
input solid or the components of the input shell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
solidOrShell is not valid for triangulation (for example, it contains no faces).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to triangulate the solid or shell.
Since:
2013

Autodesk.Revit.DB.SolidUtils.SplitVolumes(Autodesk.Revit.DB.Solid)
Splits a solid geometry into several separate solids.
Remarks:
If no splitting is done, a copy of the input solid will be returned in the output array.
solid:
The solid.
Returns:
The split solid geometries.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to split the solid geometry.
Since:
2013

Autodesk.Revit.DB.SolidUtils.CreateTransformed(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Transform)
Creates a new Solid which is the transformation of the input Solid.
solid:
The input solid to be transformed.
transform:
The transform (which must be conformal).
Returns:
The newly created Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
-or-
transform has a scale that is negative or zero.
Since:
2016

Autodesk.Revit.DB.SolidUtils.Clone(Autodesk.Revit.DB.Solid)
Creates a new Solid which is a copy of the input Solid.
solid:
The input solid to be copied.
Returns:
The newly created Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.SolidUtils
Contains utility functions for solid operations.
Since:
2013